"Please Donate" = "Vær venlig at donere";

"Donate!" = "Donér!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Det har taget mange aftener at udvikle dette program. Hvis du kan lide at bruge det, så vær venlig at overveje en donation til programmøren af denne software (det er mig!). Det vil virkelig opmuntre mig til at lave Cyberduck endnu bedre!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Når du har doneret til Cyberduck modtager du en Donationsnøgle der fjerner denne meddelelse.";

"Thank you for using Cyberduck!" = "Tak fordi du bruger Cyberduck!";

"Later" = "Senere";

"Don't show again for this version." = "Vis ikke igen.";

"The payment can be made simply and safely using Paypal. You don't need to open an account." = "Betaling kan nemt foretages med PayPal over internettet. Du behøver ikke at have en konto.";

"Donation Key" = "Donationsnøgle";

